[
    {
        "id": "6a59880d-6b93-4c80-8be6-3c122eb0ab0a",
        "name": "Django 2 by Example: Build powerful and reliable Python web applications from scratch",
        "genre": "33",
        "author": "b45023dc-337c-427b-b66e-8fcaa88ee1b5",
        "publish": "9e4cc697-5414-41a2-b09c-b3dfa9b12c15",
        "publish_date": "2021-04-18",
        "date": "2021-04-19 17:31:39",
        "language": "en",
        "edition": 1,
        "cost": "3999.00",
        "page": 621,
        "description": "if you want to learn about the entire process of developing professional web applications with Django, then this book is for you. This book will walk you through the creation of four professional Django projects, teaching you how to solve common problems and implement best practices.\r\n\r\nYou will learn how to build a blog application, a social image-bookmarking website, an online shop, and an e-learning platform. The book will teach you how to enhance your applications with AJAX, create RESTful APIs, and set up a production environment for your Django projects. The book walks you through the creation of real-world applications, while solving common problems and implementing best practices. By the end of this book, you will have a deep understanding of Django and how to build advanced web applications",
        "stock": 1,
        "today_stock": 0,
        "rating": "6.3",
        "profile": "/e_library/elibraryd112573fb442d4c61cde1f8c14827b5106fc624dc83fdc1617bd70d7e219ebe2.jpg"
    },
    {
        "id": "06768fe9-17cb-484a-8208-be35bc6befa3",
        "name": "Django Design Patterns and Best Practices - Second Edition: Industry-standard web development techniques and solutions",
        "genre": "33",
        "author": "2d248fa2-11f8-49f4-994b-b1c4f248d151",
        "publish": "9e4cc697-5414-41a2-b09c-b3dfa9b12c15",
        "publish_date": "2021-04-18",
        "date": "2021-04-18 15:44:24",
        "language": "en",
        "edition": 2,
        "cost": "2989.00",
        "page": 989,
        "description": "Building secure and maintainable web applications requires comprehensive knowledge. The second edition of this book not only sheds light on Django, but also encapsulates years of experience in the form of design patterns and best practices. Rather than sticking to GoF design patterns, the book looks at higher-level patterns. Using the latest version of Django and Python, you’ll learn about Channels and asyncio while building a solid conceptual background. The book compares design choices to help you make everyday decisions faster in a rapidly changing environment.\r\n\r\nYou’ll first learn about various architectural patterns, many of which are used to build Django. You’ll start with building a fun superhero project by gathering the requirements, creating mockups, and setting up the project. Through project-guided examples, you’ll explore the Model, View, templates, workflows, and code reusability techniques. In addition to this, you’ll learn practical Python coding techniques in Django that’ll enable you to tackle problems related to complex topics such as legacy coding, data modeling, and code reusability.\r\n\r\nYou’ll discover API design principles and best practices, and understand the need for asynchronous workflows. During this journey, you’ll study popular Python code testing techniques in Django, various web security threats and their countermeasures, and the monitoring and performance of your application.",
        "stock": 1,
        "today_stock": 1,
        "rating": "8.2",
        "profile": "/e_library/elibrary6ecd2e6451d409cc1ef84a5a8b6aad6afe4a35ea7ea0d3ec1a7f773c5e70e4cd.jpg"
    },
    {
        "id": "3e959c77-06af-49fa-ad78-eabed11f842a",
        "name": "Django for APIs: Build web APIs with Python and Django",
        "genre": "33",
        "author": "245be440-9342-4420-9bc9-efb55adb89b8",
        "publish": "9e4cc697-5414-41a2-b09c-b3dfa9b12c15",
        "publish_date": "2021-04-18",
        "date": "2021-04-18 15:33:18",
        "language": "en",
        "edition": 1,
        "cost": "2941.39",
        "page": 480,
        "description": "Django for APIs is a project-based guide to building modern APIs with Django & Django REST Framework. It is suitable for beginners who have never built an API before as well as professional programmers looking for a fast-paced introduction to Django fundamentals and best practices.",
        "stock": 1,
        "today_stock": 1,
        "rating": "7.6",
        "profile": "/e_library/elibrary3783927495a61dc924ee1c376607dc61efacf24c975ad1951752d5efa9de1433.jpg"
    },
    {
        "id": "856a4ab6-8bf7-4af1-ad10-0e5eb25bdc62",
        "name": "Django for Beginners: Build websites with Python and Django",
        "genre": "33",
        "author": "245be440-9342-4420-9bc9-efb55adb89b8",
        "publish": "9e4cc697-5414-41a2-b09c-b3dfa9b12c15",
        "publish_date": "2021-04-18",
        "date": "2021-04-18 15:31:26",
        "language": "en",
        "edition": 1,
        "cost": "3013.25",
        "page": 320,
        "description": "Django for Beginners is a project-based introduction to Django, the popular Python-based web framework. Suitable for total beginners who have never built a website before as well as professional programmers looking for a fast-paced guide to modern web development and Django fundamentals.",
        "stock": 1,
        "today_stock": 0,
        "rating": "9.6",
        "profile": "/e_library/elibraryac8661bfa6a88c48cdc939f5c621bc47b541a767bccb734f2ceffe1c694b5263.jpg"
    },
    {
        "id": "a20f4648-a282-4579-b784-fb18b2e24b65",
        "name": "Django for Professionals: Production websites with Python & Django",
        "genre": "33",
        "author": "245be440-9342-4420-9bc9-efb55adb89b8",
        "publish": "9e4cc697-5414-41a2-b09c-b3dfa9b12c15",
        "publish_date": "2021-04-18",
        "date": "2021-04-18 15:34:34",
        "language": "en",
        "edition": 1,
        "cost": "2896.58",
        "page": 652,
        "description": "Django for Professionals takes your web development skills to the next level, teaching you how to build production-ready websites with Python and Django.\r\n\r\nOnce you have learned the basics of Django there is a massive gap between building simple \"toy apps\" and what it takes to build a \"production-ready\" web application suitable for deployment to thousands or even millions of users.",
        "stock": 1,
        "today_stock": 1,
        "rating": "6.6",
        "profile": "/e_library/elibrary6de1537d8e6f53ac9a2d3765213755c4574add67855d1f092c7d78e554f0ded0.jpg"
    },
    {
        "id": "a8e25d46-b8c4-4697-9669-161b818ddab7",
        "name": "Two Scoops of Django 1.11: Best Practices for the Django Web Framework",
        "genre": "33",
        "author": "3167208c-b065-4c3e-84eb-57e4d8536624",
        "publish": "9e4cc697-5414-41a2-b09c-b3dfa9b12c15",
        "publish_date": "2021-04-18",
        "date": "2021-04-18 15:38:17",
        "language": "en",
        "edition": 1,
        "cost": "129.00",
        "page": 632,
        "description": "Two Scoops of Django 1.11 Will Help You Build Django Projects.\r\nIn this book we introduce you to the various tips, tricks, patterns, code snippets, and techniques that we've picked up over the years. We have put thousands of hours into the fourth edition of the book, writing and revising its material to include significant improvements and new material based on feedback from previous editions.",
        "stock": 1,
        "today_stock": 1,
        "rating": "6.3",
        "profile": "/e_library/elibrary48fe6d590e219dadc1fb6c50cfdfddf79fdbcbd77ee58f8a5161711266bcf7ea.jpg"
    }
]